Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
img (InputLayer)                [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
prune_low_magnitude_conv2d (Pru (None, 128, 128, 128 7042        img[0][0]                        
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 128, 128, 128 512         prune_low_magnitude_conv2d[0][0] 
__________________________________________________________________________________________________
activation (Activation)         (None, 128, 128, 128 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_1 (P (None, 128, 128, 128 295042      activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128, 128, 128 512         prune_low_magnitude_conv2d_1[0][0
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 128, 128, 128 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 64, 64, 128)  0           activation_1[0][0]               
__________________________________________________________________________________________________
dropout (Dropout)               (None, 64, 64, 128)  0           max_pooling2d[0][0]              
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_2 (P (None, 64, 64, 256)  590082      dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 64, 64, 256)  1024        prune_low_magnitude_conv2d_2[0][0
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 64, 64, 256)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_3 (P (None, 64, 64, 256)  1179906     activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 64, 64, 256)  1024        prune_low_magnitude_conv2d_3[0][0
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 64, 64, 256)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 32, 32, 256)  0           activation_3[0][0]               
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 32, 256)  0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_4 (P (None, 32, 32, 512)  2359810     dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 32, 32, 512)  2048        prune_low_magnitude_conv2d_4[0][0
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 512)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_5 (P (None, 32, 32, 512)  4719106     activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 32, 32, 512)  2048        prune_low_magnitude_conv2d_5[0][0
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 512)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 16, 16, 512)  0           activation_5[0][0]               
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 16, 16, 512)  0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_6 (P (None, 16, 16, 1024) 9438210     dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 16, 16, 1024) 4096        prune_low_magnitude_conv2d_6[0][0
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 16, 16, 1024) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_7 (P (None, 16, 16, 1024) 18875394    activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 16, 16, 1024) 4096        prune_low_magnitude_conv2d_7[0][0
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 16, 16, 1024) 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 8, 8, 1024)   0           activation_7[0][0]               
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 8, 8, 1024)   0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_8 (P (None, 8, 8, 2048)   37750786    dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 8, 8, 2048)   8192        prune_low_magnitude_conv2d_8[0][0
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 8, 8, 2048)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_9 (P (None, 8, 8, 2048)   75499522    activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 8, 8, 2048)   8192        prune_low_magnitude_conv2d_9[0][0
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 8, 8, 2048)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 16, 16, 1024) 18875392    activation_9[0][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 16, 16, 2048) 0           conv2d_transpose[0][0]           
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 16, 16, 2048) 0           concatenate[0][0]                
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_10 ( (None, 16, 16, 1024) 37749762    dropout_4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 16, 16, 1024) 4096        prune_low_magnitude_conv2d_10[0][
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 16, 16, 1024) 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_11 ( (None, 16, 16, 1024) 18875394    activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 16, 16, 1024) 4096        prune_low_magnitude_conv2d_11[0][
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 1024) 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 32, 32, 512)  4719104     activation_11[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 1024) 0           conv2d_transpose_1[0][0]         
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 32, 32, 1024) 0           concatenate_1[0][0]              
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_12 ( (None, 32, 32, 512)  9437698     dropout_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 32, 32, 512)  2048        prune_low_magnitude_conv2d_12[0][
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 32, 32, 512)  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_13 ( (None, 32, 32, 512)  4719106     activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 32, 32, 512)  2048        prune_low_magnitude_conv2d_13[0][
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 32, 32, 512)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 64, 64, 256)  1179904     activation_13[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64, 64, 512)  0           conv2d_transpose_2[0][0]         
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 64, 64, 512)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_14 ( (None, 64, 64, 256)  2359554     dropout_6[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 64, 64, 256)  1024        prune_low_magnitude_conv2d_14[0][
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 64, 64, 256)  0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_15 ( (None, 64, 64, 256)  1179906     activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 64, 64, 256)  1024        prune_low_magnitude_conv2d_15[0][
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 64, 64, 256)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 128, 128, 128 295040      activation_15[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 128, 128, 256 0           conv2d_transpose_3[0][0]         
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 128, 128, 256 0           concatenate_3[0][0]              
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_16 ( (None, 128, 128, 128 589954      dropout_7[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 128, 128, 128 512         prune_low_magnitude_conv2d_16[0][
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 128, 128, 128 0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_17 ( (None, 128, 128, 128 295042      activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 128, 128, 128 512         prune_low_magnitude_conv2d_17[0][
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 128, 128, 128 0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 128, 128, 80) 10320       activation_17[0][0]              
==================================================================================================
Total params: 251,048,180
Trainable params: 138,069,840
Non-trainable params: 112,978,340
__________________________________________________________________________________________________

